package com.example.myapplication.fragments2

import android.os.Bundle
import android.view.View
import androidx.appcompat.app.AppCompatActivity
import androidx.fragment.app.Fragment
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import com.example.myapplication.Quote
import com.example.myapplication.QuoteRecyclerAdapter
import com.example.myapplication.R


class QuotesFragment : Fragment(R.layout.fragment_quotes) {


    private lateinit var recyclerView: RecyclerView
    private lateinit var adapter: QuoteRecyclerAdapter

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        super.onViewCreated(view, savedInstanceState)

        recyclerView=view.findViewById(R.id.recyclerView)
        adapter=QuoteRecyclerAdapter(getData())
        recyclerView.layoutManager= LinearLayoutManager(context as AppCompatActivity)
        recyclerView.adapter=adapter
    }

    private fun getData(): List<Quote> {
        val quotes = ArrayList<Quote>()

        quotes.add(
            Quote(
                "არისტოტელე",
                "ყველას მეგობარი, არავის მეგობარი არაა."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "იმისთვის კი არ ვმსჯელობთ, რომ ვიცოდეთ, რა არის სათნოება, არამედ იმისათვის, რომ კარგი ადამიანები გავხდეთ."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "სიცოცხლე ითხოვს მოძრაობას."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "ყველაზე დიდი რამ, რაც მცირეშია მოთავსებული — საღი გონებაა ადამიანის სხეულში."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "ნათესავი ნაწილია ჩვენი ხორცისა, ხოლო მეგობარი — ჩვენი სულისა."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "ვაჟკაცი ისაა, ვინც უშიშრად ეგებება ამაღლებულ სიკვდილს."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "განათლება სიბერის საუკეთესო უზრუნველყოფაა."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "ის, ვინც დაძლევს შიშებს, ჭეშმარიტად თავისუფალი იქნება."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "უთანასწორობის ყველაზე უარესი ფორმაა, ეცადო არათანასწორი რაღაცები თანასწორად გარდაქმნა."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "მეგობრებს შორის მართლმსაჯულების საჭიროება არ არსებობს."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "გონების განათლება გულის განათლების გარეშე საერთოდ არ არის განათლება."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "სიკვდილი საშინლად დიდი თავგადასავალი იქნება."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "ბუნება არაფერს არ სჩადის ტყუილ-უბრალოდ."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "სირცხვილი — ერთგვარი შიშია უპატიოსნობისა."
            )
        )
        quotes.add(
            Quote(
                "არისტოტელე",
                "სამსახურში სიამოვნების განცდა სამუშაოს შესრულების ხარისხს აუმჯობესებს."
            )
        )
        quotes.add(
            Quote(
                "არქიმედე",
                "სიყვარული თეორემაა, რომელიც ყოველდღიურ დამტკიცებას მოითხოვს."
            )
        )
        quotes.add(
            Quote(
                "ჯორჯ გორდონ ბაირონი",
                "განსაცდელი ბრძენთა მასწავლებელია."
            )
        )
        quotes.add(
            Quote(
                "ჯორჯ გორდონ ბაირონი",
                "მე თუ შენ გამო სამყაროს დავკარგავდი, სამყაროს სანაცვლოდ შენ არ დაგკარგავდი."
            )
        )
        quotes.add(
            Quote(
                "ჯორჯ გორდონ ბაირონი",
                "ერთი ცრემლის გაშრობა ბევრად რთულია, ვიდრე ზღვა სისხლის დაღვრა."
            )
        )
        quotes.add(
            Quote(
                "ჯორჯ გორდონ ბაირონი",
                "ღამე ბრწყინვალებას ჰმატებს ვარსკვლავებსა და ქალებს."
            )
        )
        quotes.add(
            Quote(
                "ჯორჯ გორდონ ბაირონი",
                "განვლილი ბედნიერების მოგონება ბედნიერება აღარ არის. გადატანილი ტკივილის მოგონება — ეს ჯერ კიდევ ტკივილია."
            )
        )
        quotes.add(
            Quote(
                "ჯორჯ გორდონ ბაირონი",
                "ვინც ჩუმად ტირის, ის ჭეშმარიტად გლოვობს."
            )
        )
        quotes.add(
            Quote(
                "რიჩარდ ბახი",
                "ჩვენ გამართლებული უფლება გვაქვს ვიფრინოთ იქით, საითაც გვინდა და ვიყოთ ისეთნი როგორიც გავჩნდით."
            )
        )

        quotes.add(
            Quote(
                "რიჩარდ ბახი",
                "სურვილი ყოველთვის იმ ძალასთან ერთად ჩნდება რომლითაც მისი ასრულებაა შესაძლებელი."
            )
        )
        quotes.add(
            Quote(
                "რიჩარდ ბახი",
                "შენი უცოდინრობა იმით იზომება, თუ რამდენად ღრმად გჯერა უსამართლობის და ადამიანის ტრაგიკულობის."
            )
        )
        quotes.add(
            Quote(
                "რიჩარდ ბახი",
                "უსიამოვნებები ყველაზე უარესი არ არის რაც შეიძლება მოხდეს ჩვენთვის, ყველაზე უარესია როდესაც არაფერი არ ხდება."
            )
        )
        quotes.add(
            Quote(
                "რიჩარდ ბახი",
                "თუ შენი ბედნიერება იმაზეა დაყრდნობილი სხვა როგორ მოიქცევა, ეს იმას ნიშნავს, რომ შენ დიდი პრობლემა გაქვს."
            )
        )
        quotes.add(
            Quote(
                "რიჩარდ ბახი",
                "შენ თავისუფალი ხარ შექმნა და პატივი სცე ნებისმიერ წარსულს, რომელსაც შენ ამოირჩევ, რათა განკურნო და გარდაქმნა საკუთარი მომავალი."
            )
        )
        quotes.add(
            Quote(
                "ლუდვიგ ვან ბეთჰოვენი",
                "ყოველ ხელოვანს უნდა გააჩნდეს გამბედაობა, რომლის გარეშეც წარმოუდგენელია ტალანტი."
            )
        )
        quotes.add(
            Quote(
                "ლუდვიგ ვან ბეთჰოვენი",
                "თავისუფლება და პროგრესი - აი, მიზანი ჭეშმარიტი ხელოვნებისა და მთელი ცხოვრებისა."
            )
        )
        quotes.add(
            Quote(
                "ოტო ფონ ბისმარკი",
                "ისე ისწავლე, თითქოს მარადიული ცხოვრებისთვის იყო გაჩენილი, მაგრამ იცხოვრე ისე, თითქოს ხვალ უნდა მოკვდე."
            )
        )
        quotes.add(
            Quote(
                "ოტო ფონ ბისმარკი",
                "როდესაც გსურს, გააბრიყვო მთელი მსოფლიო, ილაპარაკე სიმართლე."
            )
        )
        quotes.add(
            Quote(
                "ოტო ფონ ბისმარკი",
                "თავისუფლება ფუფუნებაა, რომლის უფლებასაც თავს ყველა ვერ მისცემს."
            )
        )
        quotes.add(
            Quote(
                "ოტო ფონ ბისმარკი",
                "სულელები საკუთარ შეცდომებზე სწავლობენ და ჭკვიანები - სხვების შეცდომებზე."
            )
        )
        quotes.add(
            Quote(
                "ოტო ფონ ბისმარკი",
                "სიბრიყვე ღვთისგან ბოძებული ნიჭია, მაგრამ არაა საჭირო, ბოროტად ისარგებლო ამ ნიჭით."
            )
        )
        quotes.add(
            Quote(
                "ოტო ფონ ბისმარკი",
                "ქალის და კაცის მეგობრობა მაშინვე იხევს უკანა პლანზე, როცა მზე იწყებს ჩასვლას."
            )
        )
        quotes.add(
            Quote(
                "შარლ ბოდლერი",
                "ძალზე მცირეა ისეთი გართობანი, დანაშაულად რომ არ იქცევიან ბოლოს."
            )
        )
        quotes.add(
            Quote(
                "შარლ ბოდლერი",
                "მართალია, ოდნავ მრცხვენია წარსულის გახსენების, მაგრამ არც დავიწყება მსურს რაიმესი."
            )
        )
        quotes.add(
            Quote(
                "შარლ ბოდლერი",
                "ვერ წარმომიდგენია სილამაზე, რომელიც უბედურებასთან არაა კავშირში."
            )
        )
        quotes.add(
            Quote(
                "ჯოვანი ბოკაჩო",
                "ყველაზე ნაკლებად სხვებს იმ შეცდომებს ვპატიობთ, რომელთაც თავად ვუშვებთ ცხოვრებაში."
            )
        )
        quotes.add(
            Quote(
                "გაიუს იულიუს კეისარი",
                "ადამიანი ადვილად დაიჯერებს ხოლმე იმას, რაც მისთვის სასურველია."
            )
        )
        quotes.add(
            Quote(
                "გაიუს იულიუს კეისარი",
                "ქალაქში მეორე კაცად ყოფნას პროვინციაში პირველ კაცად ყოფნა ჯობს."
            )
        )
        quotes.add(
            Quote(
                "გალილეო გალილეი",
                "მირჩევნია წვრილმან და უმნიშვნელო საგნებში ვიპოვო ჭეშმარიტება, ვიდრე ვიმსჯელო დიად საკითხებზე და ვერ მივწვდე მას."
            )
        )
        quotes.add(
            Quote(
                "გალილეო გალილეი",
                "არ არსებობს იმაზე დიდი სიძულვილი, ვიდრე ცოდნის მიმართ სიძულვილია."
            )
        )
        quotes.add(
            Quote(
                "გალილეო გალილეი",
                "არ შემხვედრია ადამიანი იმდენად სულელი, რომ მისგან რაიმე არ მესწავლა."
            )
        )
        quotes.add(
            Quote(
                "მაჰათმა განდი",
                "მე მომწონს ქრისტე, მაგრამ მე არ მომწონს ქრისტიანები, რადგან ისინი ძალიან განსხვავდებიან ქრისტესგან."
            )
        )
        quotes.add(
            Quote(
                "მაჰათმა განდი",
                "ძალადობით მოპოვებული გამარჯვება დამარცხების ტოლფასი და მოკლეა."
            )
        )
        quotes.add(
            Quote(
                "მაჰათმა განდი",
                "სუსტებს არ შეუძლიათ პატიება."
            )
        )
        quotes.add(
            Quote(
                "მაჰათმა განდი",
                "გინდა შეცვალო სამყარო? დაიწყე შენგან."
            )
        )
        quotes.add(
            Quote(
                "ნიკოლოზ გოგოლი",
                "ხშირად სამყაროსათვის შესამჩნევი სიცილის მიღმა, იღვრება სამყაროსთვის შეუმჩნეველი ცრემლები."
            )
        )
        quotes.add(
            Quote(
                "ნიკოლოზ გოგოლი",
                "საკუთარ თავთან ვალდებულებაზე სასიამოვნო არაფერია."
            )
        )
        quotes.add(
            Quote(
                "ნიკოლოზ გოგოლი",
                "გაჭირვებით და სიმწრით ჩვენ შეგვიძლია გონიერებას შევმატოთ ის კვანძი, რომელსაც ვერ ამოვიკითხავთ წიგნებში."
            )
        )
        quotes.add(
            Quote(
                "ნიკოლოზ გოგოლი",
                "იყო ქვეყნად და არაფრით აცხადებდე შენს არსებობას, ეს საშინელებაა."
            )
        )
        quotes.add(
            Quote(
                "ოიჰან ვოლფგანგ ფონ გოეთე",
                "მაღალ სწრაფვათა მიღწევაზე ვინ იტყვის უარს! მაგრამ გარეგნულ ბრწყინვალებას ელტვიან უმალ."
            )
        )
        quotes.add(
            Quote(
                "ოიჰან ვოლფგანგ ფონ გოეთე",
                "ოღონდ საკუთარ თავისადმი ნდობა გაგაჩნდეს, და სულ ადვილად მოევლება უკვე დანარჩენს."
            )
        )
        quotes.add(
            Quote(
                "ოიჰან ვოლფგანგ ფონ გოეთე",
                "ყველაზე სასაცილოა სურვილი, რომ ყველას მოსწონდე."
            )
        )
        quotes.add(
            Quote(
                "ოიჰან ვოლფგანგ ფონ გოეთე",
                "უმჯობესია რომელიმე მეგობრისგან მოტყუებული დარჩე, ვიდრე თავად შენ მოატყუო ისინი."
            )
        )
        quotes.add(
            Quote(
                "ოიჰან ვოლფგანგ ფონ გოეთე",
                "ვფიქრობ, მათზე უკეთესი ვარ, ვინც ჩემს რეფორმირებას ცდილობს."
            )
        )
        quotes.add(
            Quote(
                "ოიჰან ვოლფგანგ ფონ გოეთე",
                "...კარგი,ვინ ხარ,მაშ,შენ,ნეტავ?...მე ვარ ნაწილი იმ დიად ძალის, ვისაც ავი სურს და კეთილს სჩადის. "
            )
        )
        quotes.add(
            Quote(
                "თეოფილ გოტიე",
                "ყველა ნანგრევზე მძიმეა განადგურებული, დანგრეული ადამიანის ცქერა."
            )
        )
        quotes.add(
            Quote(
                "თეოფილ გოტიე",
                "ადამიანისთვის ბუნებრივია სამყაროში არსებულის ბოროტად გამოყენება, მათ შორის საკუთარი ღირსებისაც."
            )
        )
        quotes.add(
            Quote(
                "მაქსიმ გორკი",
                "ადამიანი თუ ოქროთი მოწამლე, მას სული დაუპატარავდება."
            )
        )
        quotes.add(
            Quote(
                "მაქსიმ გორკი",
                "ნუ გეშინია საკუთარ თავზე სიცილის, რადგან თვითკრიტიკა ისევე აუცილებელია, როგორც სახის ჩამობანა."
            )
        )
        quotes.add(
            Quote(
                "მაქსიმ გორკი",
                "სიცოცხლით ტკბობას აუცილებლად შეერწყმება სიკვდილის სურვილი."
            )
        )
        quotes.add(
            Quote(
                "მაქსიმ გორკი",
                "ნუ იქნებით გულგრილნი, რადგან გულგრილობა სულის ჯალათია."
            )
        )
        quotes.add(
            Quote(
                "ვოლტერი",
                "არასოდეს არ ხდება დიდი საქმე დიდი სიძნელეების გარეშე."
            )
        )
        quotes.add(
            Quote(
                "ვოლტერი",
                "მანამდე მაინც დავრჩეთ ადამიანებად, სანამ მეცნიერებას არ აღმოუჩენია, რომ ვიღაც სხვანი ვართ."
            )
        )
        quotes.add(
            Quote(
                "ვოლტერი",
                "როდესაც ჭამ, საჭმელი დაუყარე ძაღლებსაც, თუნდაც საკბენად გეტანებოდნენ."
            )
        )
        quotes.add(
            Quote(
                "ვოლტერი",
                "ადამიანები არასოდეს განიცდიან სინდისის ქენჯნას ჩვეულებად ქცეული საქციელის გამო."
            )
        )
        quotes.add(
            Quote(
                "ვოლტერი",
                "არასდროს გააღმერთო ბავშვი, თორემ გაიზრდება და თაყვანისცემას მოგთხოვს."
            )
        )
        quotes.add(
            Quote(
                "ვოლტერი",
                "ცრურწმენები - ეს ისაა, რასაც ბრიყვები ყველაფერს აბრალებენ."
            )
        )
        quotes.add(
            Quote(
                "ვოლტერი",
                "ზვავის შემადგენელი თოვლის ფიფქი არასდროს გრძნობს პასუხისმგებლობას."
            )
        )
        quotes.add(
            Quote(
                "ვოლტერი",
                "შემთხვევითობა არ არსებობს! ყველაფერი გამოცდაა, ან დასჯა, ან ჯილდო, ან კიდევ წინასწარჭვრეტა."
            )
        )
        quotes.add(
            Quote(
                "აგათა კრისტი",
                "ცხოვრება გაბმული ხუმრობაა, ბოლოს კი სიკვდილი იცინის."
            )
        )
        quotes.add(
            Quote(
                "აგათა კრისტი",
                "ძალზე დამღლელია იმ ადამიანთან ურთიერთობა, რომელიც ყოველთვის მართალია."
            )
        )
        quotes.add(
            Quote(
                "აგათა კრისტი",
                "ყველა უბედურება ფულის და უფულობის გამო ხდება."
            )
        )
        quotes.add(
            Quote(
                "აგათა კრისტი",
                "მხოლოდ იმ მომენტში, როდესაც ხედავ რაოდენ სასაცილოა ხალხი, ხვდები თუ რაოდენ ძლიერ გიყვარს ისინი."
            )
        )
        quotes.add(
            Quote(
                "აგათა კრისტი",
                "მე მიყვარს ცხოვრება და ვერანაირი ჯოჯოხეთური წამება და უბედურება ვერ გადამათქმევინებს, რომ უბრალოდ ცხოვრება დიდი მადლია."
            )
        )





        return quotes
    }


}